Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་སྦྱངས་སོ། ཡོངས་སུ་སྦྱངས་སོ། རྣམ་པར་བཀོད་དོ། རྣམ་པར་བལྟས་སོ། རྣམ་པར་དཔྱད་དོ། རྗེས་སུ་བཙལ་ཏོ། ཡོངས་སུ་བརྟགས་སོ། རྣམ་པར་བྲིས་སོ། རྒྱ་ཆེར་བྱས་སོ། རིགས་ཀྱི་བུ་དེ་ལྟར་ད་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་འདི་ལ་གནས་ཤིང་ཆོས་དང་འཐུན་པར་ཁམས་སྐྱོང་ཞིང་སྟོན་ཏོ། །ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་ལ་ཕན་པར་བྱེད་དོ། །ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་ན་རྗེས་སུ་སྤྱོད་དོ། །ཆོས་དང་འཐུན་པར་སེམས་ཅན་བཅོས་བ་བྱེད་དོ། ཆོས་དང་འཐུན་པར་སེམས་ཅན་རྣམས་ལ་ནན་ཏན་བྱེད་དོ། ཆོས་ཀྱི་དཀྱིལ་འཁོར་ལ་སེམས་ཅན་རྣམས་ཡོངས་སུ་འཛུད་དོ། ཆོས་ཀྱི་ཚུལ་སེམས་ཅན་རྣམས་ལ་ཉེ་བར་བསྒྲུབ་བོ། ཆོས་དང་འཐུན་པར་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་བསྒོ་བ་བྱེད་དོ། ཆོས་ཀྱི་ནན་ཏན་ལ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྦྱོར་རོ། ཆོས་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པ་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་དོ། །བྱམས་པའི་སེམས་དང་། བྱམས་པ་ཆེན་པོའི་དབང་དང་། བྱམས་པའི་སྟོབས་དང་། ཕན་པའི་སེམས་དང་། བདེ་བའི་སེམས་དང་།
en: From them I received it, purified it, completely purified it, established it, viewed it, analyzed it, followed it, sought it, examined it, wrote it out, and promulgated it.

source: སྙིང་རྗེའི་སེམས་དང་། ཕན་འདོག་པའི་སེམས་དང་། ཡོངས་སུ་བསྲུང་བའི་སེམས་དང་། སེམས་ཅན་ཡོངས་སུ་འཛིན་པ་མི་གཏོང་བའི་སེམས་དང་། སྡུག་བསྔལ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་སྨོན་ལམ་རྒྱུན་མི་གཅོད་པའི་སེམས་དང་།
en: “Noble one, in that way I have remained in this bodhisattva conduct called the banner of great love, and I rule the kingdom in accord with the Dharma, I take care of the world in accord with the Dharma, I carry out conduct in the world in accord with the Dharma, I cause beings to be in accord with Dharma, I bring beings into the domain of the Dharma, I bring beings into the way of the Dharma, I command beings in accord with Dharma, I make beings dedicate themselves to the practice of the Dharma, I establish beings in the understanding of the nature of the Dharma, and I establish beings in a loving state of mind, in the power of great love, in the strength of love, in an altruistic state of mind, in a happy state of mind, in a sympathetic state of mind, in a caring state of mind, in a protective state of mind, in a state of mind that never ceases to be protective of beings, and in a state of mind of continuously aspiring to eliminate all suffering, and I establish beings in a continuous conduct that leads them to the ultimate happiness.

source: བདེ་བའི་མཐར་ཕྱིན་པ་ལ་རབ་ཏུ་དགོད་པར་ཡང་དག་པར་སྤྱོད་པ་རྒྱུན་མི་གཅོད་པ་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་དོ། བག་ཡངས་ཀྱི་བདེ་བ་ཡང་དག་པར་བསྐྱེད་པས་སེམས་ཅན་དེ་དག་གི་ལུས་ཀྱང་ཤིན་ཏུ་བདེ་བར་བྱེད་དོ། །
en: “I also bring physical ease to beings by giving rise to the happiness of serenity.

source: དེ་དག་གི་འཁོར་བའི་བདེ་བ་ལ་ཞེན་པའི་སེམས་ཀྱི་རྒྱུད་ཀྱང་རྣམ་པར་བཟློག་པ་བྱེད་དོ།
en: I turn the continuums of their minds away from attachment to the pleasures of saṃsāra.

source: དེ་དག་གི་སེམས་ཀྱི་རྒྱུན་ཀྱང་ཆོས་ཀྱི་དགའ་བ་དང་མོས་པ་ལ་ཡོངས་སུ་གཞོལ་བར་བྱེད་དོ། །
en: I bring beings to delight in the pleasures of the Dharma.

source: ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་ལས་རྣམ་པར་སྦྱོང་བ་བྱེད་དོ།
en: I cleanse them of all the stains of the kleśas.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལས་ཡོངས་སུ་སྦྱོང་བ་བྱེད་དོ།
en: I purify them of all bad qualities.

source: འཁོར་བའི་རྒྱུན་ལས་རྣམ་པར་བཟློག་པ་བྱེད་དོ།
en: I turn them away from the continuum of saṃsāra.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཡོངས་སུ་གཟུད་པ་བྱེད་དོ། །
en: I turn them toward the ocean of the ways of the realm of Dharma.

source: དེ་དག་གིས་སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བ་ཐམས་ཅད་རྒྱུན་གཅད་པའི་ཕྱིར། སེམས་ཀྱི་མ་རིག་པ་ཡོངས་སུ་བསྲག་པ་བྱེད་དོ།
en: I burn away the ignorance in their minds in order to end all rebirths in the states of existence.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་འབྲས་བུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དེ་དག་གི་སེམས་ཀྱི་མྱུ་གུ་བསྐྱེད་དོ།
en: I cause light to arise in their minds so that they attain the result that is omniscience.

source: མི་འཕྲོགས་པའི་དད་པའི་སྟོབས་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར་དེ་དག་གི་སེམས་ཀྱི་རྒྱ་མཚོ་ཡང་རབ་ཏུ་དང་བར་བྱེད་དོ།
en: I make the ocean of their minds clear so that they will give rise to the strength of unassailable faith.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་ལ་གནས་ཏེ། ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་སྐྱོང་ཞིང་སྟོན་ཏོ།
en: “Noble one, in that way I have remained in this bodhisattva conduct called the banner of great love, and I rule the kingdom in accord with the Dharma.

source: རིགས་ཀྱི་བུ་ངའི་ཁམས་ན་གནས་པའི་སེམས་ཅན་རྣམས་ནི་ངས་འཇིགས་ཤིང་སྡང་པའམ། བག་ཚ་ཞིང་སྐྱི་གཡའ་བ་མེད་དེ།
en: “Noble one, I do not cause the beings who dwell in my realm to be frightened, terrified, or alarmed or to horripilate.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་ཕོངས་ཤིང་ཡོ་བྱད་སྣ་ཚོགས་ཀྱིས་བྲེལ་བ། བཟའ་བ་འདོད་པའམ། བཏུང་བ་འདོད་པའམ། གོས་འདོད་པ་ནས་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་གང་འདོད་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ངའི་དྲུང་དུ་འོང་ངོ་། །
en: “Noble one, those beings who are poor and deprived of necessities, who wish for food, who wish for drink, who wish for clothes, and who wish for every kind of requisite all come before me.

source: དེ་དག་ལའང་ངས་སྔ་ནས་བཤམ་བཤམ་པའི་མཛོད་སྒོ་ཕྱེ་ཞིང་ཅི་འདོད་པ་ཁྱེར་ཅིག་ཅེས་བསྟབས་ཏེ། གང་གི་དོན་དུ་ཁྱེད་སྡིག་པའི་ལས་ལ་སྤྱོད་པར་གྱུར་ཅིང་། སྲོག་གཅོད་པའམ། མ་བྱིན་པར་ལེན་པའམ། འདོད་པས་ལོག་པར་གཡེམ་པའམ། བརྫུན་དུ་སྨྲ་བ་འམ། ཕྲ་མ་འམ། ངག་རྩུབ་པོའམ། ཚིག་ཀྱལ་པའམ། ཆགས་སེམས་དང་། གནོད་སེམས་སམ། ལོག་པར་ལྟ་བའམ། དེ་མ་ཡིན་པའི་ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: I open the door to the treasures that I have previously accumulated, and I say to them, ‘Take whatever you wish—all those things for which you would otherwise engage in the bad actions of killing, taking what has not been given, sexual misconduct, lying, slander, harsh speech, idle talk, craving, malice, false views, and attachment to various incorrect views!

source: གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་འདིའི་སྒོ་དང་། སྲང་དང་། ཁྱམས་དང་། ལམ་གྱི་སུམ་མདོ་དང་། བཞི་མདོ་ཀུན་ཏུ་སྤུངས་ཏེ།
en: All of those things have been provided by me, and they are heaped at the doors in the streets, in the courtyards, at the junctions of three streets, and at the crossroads of four streets in this great city of Suprabha—anyone may take whatever they wish!’

source: སྔ་ནས་བྱིན་པ་ཡིན་གྱི། སུ་ཅི་འདོད་པ་ཀུན་ཀྱང་ཁྱེར་ཅིག་ཅེས་བསྟབས་ཤིང་བྱིན་ནོ། །
en: I tell them this and give it to them.

source: རིགས་ཀྱི་བུ་གྲོང་ཁྱེར་འོད་བཟང་པོ་འདི་ན་སེམས་ཅན་ཇི་སྙེད་ཅིག་གནས་པ་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྟེ་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའོ། །དེ་བས་ན་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་འདི་ཡང་དེ་དག་ལ་བསམ་པ་རྣམ་པ་ཇི་ལྟ་བུར་དག་པའི་ཚུལ་བཞིན་དུ་སྣང་སྟེ། ལ་ལ་ལ་ནི་དོག་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་ཡངས་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་གཞིས་ལ་གནས་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་གཞི་རིན་པོ་ཆེ་བཻ་ཌཱུརྱ་ལས་བླངས་པར་སྣང་ངོ་། །
en: “Noble one, all the beings who dwell in this great city are bodhisattvas who follow the Mahāyāna.

source: ལ་ལ་ལ་ནི་སའི་ར་བས་བསྐོར་བར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་རིན་པོ་ཆེ་རྡོ་རྗེ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ར་བས་བསྐོར་བར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་གསེག་མ་དང་གྱོ་མོས་གང་ཞིང་ཐག་ཐུག་དང་གྲོག་པོ་དང་། གཡང་ས་མང་པོ་ཅན་དུ་སྣང་ངོ་། །ལ་ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་གྲངས་མེད་པས། གཞི་བརྒྱན་ཅིང་ཡོངས་སུ་བཀྲམ་པ་དང་། ལག་མཐིལ་བཞིན་དུ་གཞི་མཉམ་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་ས་ལས་བྱས་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་རིན་པོ་ཆེ་གྲངས་མེད་པའི་ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་བཟང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁང་སྟེང་དང་། བ་གམ་དང་།
en: “Noble one, this great city of Suprabha appears to them in accordance with their way of thinking: to some it appears small, while to some it appears vast; to some the ground appears to be made of earth, while to some the ground appears to be made of beryl jewels; to some it appears to be encircled by a wall of clay, while to some it appears to be encircled by a wall of precious diamonds and banners of invincibility; to some it appears to be filled with pebbles and potsherds, to be uphill and downhill, and to have many chasms and precipices, while to some it appears to have ground that is covered and adorned with countless excellent precious jewels and to be as flat as the palm of the hand; to some it appears to be made of earth, while to some it appears to be adorned by countless precious dwellings, aerial palaces, mansions, and kūṭāgāras adorned by roof decks with balustrades, spires, round windows, networks of strings of beads, crescent moons, and trellises of lion adornments.

source: སྐར་ཁུང་གི་ཤར་བུ་དང་། ཟླ་གམ་རིན་པོ་ཆེ་སེང་གེའི་དྲ་བས་བརྒྱན་པར་སྣང་ངོ་། །གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་ན་གནས་པའི་སེམས་ཅན་སྔོན་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་བསྡུས་པ།
en: “Among the beings who live outside the city, there are those who, when I was practicing bodhisattva conduct in past lives, gathered around me as pupils through the four methods of gathering pupils.

source: བསམ་པ་དག་པ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: They have pure motivation, have created the roots of merit, have served many buddhas, aspire to omniscience, and are set on omniscience.

source: སངས་རྒྱས་མང་པོ་བསྙེན་བཀུར་བ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་པར་མོས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རབ་ཏུ་གཞོལ་བ་དེ་དག་ལ་ཡང་རིན་པོ་ཆེ་ལས་བྱས་པར་སྣང་ངོ་། །
en: To them the city appears to be made of jewels.

source: དེ་མ་ཡིན་པ་གཞན་དག་ལ་ནི་ས་ལས་བྱས་པར་སྣང་སྟེ། རིགས་ཀྱི་བུ་ངའི་ཁམས་ན་གནས་པའི་སེམས་ཅན་ཡུལ་དང་ཕྱོགས་དང་།
en: To the others it appears to be made of earth.

source: གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་། ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དག་ན་རྙོག་པ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་དུས་ཀྱི་རང་བཞིན་གྱིས་དཀྲུགས་ཏེ། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཞིག་བྱེད་པར་འདོད་པར་གྱུར་ན་ཡང་། དེའི་ཚེ་ང་དེ་དག་ལ་ཕན་པར་བྱ་བའི་སེམས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་ཞེས་བྱ་བ་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ་ལ་སྙོམས་པར་འཇུག་སྟེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་པ་དང་།
en: “Noble one, when the beings who live in my realm, in the districts and subdistricts, in the villages, towns, and markets, in the country and the capital, are disturbed by the nature of the times in a world that has the five degenerations and want to practice the path of the ten bad actions, then at that time, wishing to benefit them, I enter the bodhisattva samādhi called exercising power over the world through being motivated by great love.

source: དེ་ཉིད་ཀྱི་མོད་ལ་སེམས་ཅན་དེ་དག་གི་འཇིགས་པ་དེ་དག་དང་མི་བདེ་བ་དེ་དག་དང་། ཤར་གཉེར་བ་དེ་དག་དང་ཐབ་མོ་དང་རྩོད་པ་དེ་དག་དང་། སེམས་ཀྱི་འཁྲུག་པ་དེ་དག་དང་། འཚེ་བའི་སེམས་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ་དེའི་ཆོས་ཉིད་ཐོབ་པས་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །ཉེ་བར་ཞི་བར་གྱུར་ཏོ། །
en: “Noble one, as soon as I rest in that samādhi, the fears, misfortunes, hostilities, disputes, mental disturbances, and violent intentions of those beings cease, are extinguished, are eliminated, and are brought to an end through their attaining the nature of the bodhisattva samādhi called exercising power over the world through being motivated by great love.

source: རྣམ་པར་ལྡོག་པར་གྱུར་ཏོ། །འགག་པར་གྱུར་ཏོ། །རིགས་ཀྱི་བུ་ཡུད་ཙམ་ཞིག་སྡོད་དང་དེའུ་རེ་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: “Noble one, stay a moment and you will see a sight.”

source: དེ་ནས་རྒྱལ་པོ་འོད་ཆེན་པོས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་ལ་མཉམ་པར་གཞོག་གོ །དེ་ལྟར་རྒྱལ་པོ་འོད་ཆེན་པོས། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱམས་པ་ཆེན་པོའི།
en: Then King Mahāprabha entered the bodhisattva samādhi called exercising power over the world through being motivated by great love.

source: སྔོན་དུ་འགྲོ་བ་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་ལ་མཉམ་པར་བཞག་མ་ཐག་ཏུ་དེའི་མོད་ལ་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་ཡུལ་དང་། ཕྱོགས་སུ་བཅས་པ། གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་། ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་གི་འཁོར་དང་བཅས་པ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །དེ་གཡོས་པའི་ཚེ་རིན་པོ་ཆེའི་ར་བ་དེ་དག་དང་རིན་པོ་ཆེའི་ཁང་པ་དང་། རིན་པོ་ཆེའི་སྙིང་པོ་དང་། རིན་པོ་ཆེའི་ཁྱིམ་དང་། རིན་པོ་ཆེའི་གནས་དང་། རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་དང་།
en: As soon as he entered the bodhisattva samādhi called exercising power over the world through being motivated by great love, the great city of Suprabha and its districts and subdistricts, its villages, towns, and markets, the land and the kingdom, the capital, and its environs all shook in six ways.

source: རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དང་། རིན་པོ་ཆེའི་བ་གམ་དང་། རིན་པོ་ཆེའི་པུ་ཤུ་དང་། རིན་པོ་ཆེའི་སྐར་ཁུང་དང་། རིན་པོ་ཆེའི་སྟེགས་བུ་དང་། རིན་པོ་ཆེའི་རྟ་བབས་དང་། རིན་པོ་ཆེའི་ཟླ་གམ་དང་། རིན་པོ་ཆེའི་སེང་གེའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་ལན་ཀན་དང་། རིན་པོ་ཆེའི་འབྲུ་དང་། རིན་པོ་ཆེའི་བླ་རེ་དང་། རིན་པོ་ཆེའི་སྲད་བུས་བརྒྱུས་པའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་དྲིལ་བུ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེའི་བ་དན་དང་། རིན་པོ་ཆེའི་ཏ་ལ་དེ་དག་ཀྱང་རབ་ཏུ་གཡོས་ཏེ།
en: When they shook, the precious walls, precious mansions, precious interiors, precious houses, precious dwellings, precious aerial palaces, precious kūṭāgāras, precious spires, precious balustrade rooftops, precious round windows, precious balconies, precious toraṇas, precious crescents, precious lattices of lion adornments, precious railings, precious disks, precious canopies, precious strings of little spherical bells, precious bells, precious banners, precious flags, and precious palm trees also shook, made loud sounds, and jingled.

source: སྒྲ་འབྱིན་ཏོ། རབ་ཏུ་འཁྲོལ་ལོ། དེ་དག་དེ་ལྟར་སྒྲ་འབྱིན་ཅིང་ཡིད་དུ་འོང་ལ་སྙན་པ་དང་། མཉན་ན་དགའ་བའི་དབྱངས་རྗོད་ཅིང་། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་འདུད་ཏེ་ཕྱག་འཚལ་ལོ། །
en: When they resounded, they emitted beautiful, delightful sounds, so that those people bowed and made obeisance in the direction of King Mahāprabha.

source: གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོའི་ནང་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། དགའ་བ་དང་རངས་པའི་སེམས་ཀྱིས་ཡོངས་སུ་རྒྱས་ནས། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་ལོགས་སུ་མངོན་ཏུ་ལྟ་སྟེ། ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ཅིང་ཕྱག་འཚལ་ལོ། །
en: All those beings who dwelled within the great city of Suprabha experienced increased happiness and joy, turned to face the direction of King Mahāprabha, and prostrated their entire bodies on the ground in homage.

source: དེའི་ཁམས་ཀྱི་གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཡུལ་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ན་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལུས་དང་སེམས་བདེ་བར་གྱུར་ཏེ། དགའ་ཞིང་རངས་པ་སྐྱེས་ནས། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་ཕྱག་འཚལ་ལོ། །
en: Those beings who lived in the villages, the towns, the marketplaces, the land, the kingdom, the capital, and its environs all became blissful in mind and body, and with happiness and joy they bowed down in the direction of King Mahāprabha.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་སུ་ལྡན་པར་གྱུར་ནས།
en: The beings who had been reborn as animals all became kind toward one another and wished to help one another.

source: རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་ལོགས་སུ་ལྟ་ཞིང་མངོན་པར་འདུད་དོ། །
en: They all turned to look in the direction of King Mahāprabha and bowed down to him.

source: རི་དང་སྒངམཐོན་པོའི་སའི་ཕྱོགས་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བདེར་མངོན་པར་འདུད་དོ། མེ་ཏོག་གི་ཤིང་དང་། འབྲས་བུའི་ཤིང་དང་། ལོ་མའི་ཤིང་དང་། ས་བོན་གྱི་ཚོགས་དང་།
en: Even the land, all the mountain peaks, and the other lofty lands bowed toward King Mahāprabha.

source: འབྱུང་བའི་ཚོགས་དང་། ལོ་ཏོག་དང་། ལྡུམ་བུ་དང་། རྩ་དང་གེལ་པ་དང་། སྨན་དང་ནགས་ཚལ་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་ལྟ་ཞིང་མངོན་པར་འདུད་པར་གྱུར་ཏོ། །དེའི་ཁམས་ན་མཚོ་དང་། མཚེའུ་དང་། ལུ་མ་དང་།
en: All the flowering trees, fruit trees, leafy trees, edible plants, vegetation, crops, grasses, bushes, herbs, and forests turned in the direction of King Mahāprabha and bowed down toward him.

source: ལྡེང་ཀ་དང་། འབབ་ཆུ་དང་། ཆུ་ཀླུང་དང་། རྫིང་དང་། ཁྲོན་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་མངོན་པར་གཞོལ་ཞིང་རླབས་ཀྱི་སྒྲ་འབྱིན་པར་གྱུར་ཏོ། །
en: All the springs, lakes, ponds, reservoirs, waterfalls, rivers, lotus ponds, and wells in his realm turned and made the sounds of flowing in the direction of King Mahāprabha.

source: ཀླུའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུ་ཡང་། ཨ་ག་རུ་ནག་པོའི་བདུག་སྤོས་ཀྱི་དུད་པ་ན་བུན་དུ་འགྲིགས་པའི་སྤོས་ཀྱི་སྤྲིན་ལས་གློག་སྣ་ཚོགས་འགྱུ་བའི་འོད་ཀྱི་སྣང་བར་བྱེད་ཅིང་། འབྲུག་སྒྲ་སྒྲོག་པ་དང་། སྤོས་ཆུའི་ཆར་གྱི་རྒྱུན་ཤིན་ཏུ་ཕྲ་བ་མངོན་པར་འབེབས་པར་གྱུར་ཏོ། །
en: Ten thousand nāga kings caused a mass of smoke of great black-agarwood incense to form a cloud of perfume, from which came the illumination of bright streaks of lightning, the roar of thunder, and a fine rain of perfumed water that fell in all four directions.

source: བརྒྱ་བྱིན་དང་རབ་མཚེ་མ་དང་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དགའ་དང་། དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོ་ལ་སྩོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུས་ཀྱང་སྟེང་གི་བར་སྣང་ལ་འཁོད་དེ་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ལྷ་རྫས་ཀྱི་རོལ་མོ་སིལ་སྙན་གྱི་སྤྲིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་སྒྲ་ཕྱུང་བས་དབྱངས་སྙན་པ་རྒྱ་ཆེར་བསྒྲགས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: Ten thousand devas, such as the deva lords Śakra, Suyāma, Saṃtuṣita, Sunirmita, and Vaśavartin gathered in the sky facing him and made offerings to King Mahāprabha: The entire expanse of the sky resounded with the vast melodious sound from clouds of a quintillion divine musical instruments.

source: ལྷའི་བུ་མོ་གྲངས་མེད་པ་ལྷའི་གླུ་སྙན་པ་ལེན་པའི་སྤྲིན་གྱི་སྒྲ་བསྒྲགས་པའི་དབྱངས་སྙན་ཅིང་ཡིད་དུ་འོང་བའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: A gathering of countless apsarases created the adornment of sweet, beautiful sounds from clouds of divine songs.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine, precious flowers.

source: ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་སྤྲིན་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine incenses of various colors.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine, precious garlands.

source: ལྷ་རྫས་ཀྱི་ཕྱེ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine powders of various colors.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ལྷབ་ལྷུབ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine, precious jewelry.

source: ལྷ་རྫས་ཀྱི་གོས་སྣ་ཚོགས་དྲི་མ་མེད་ཅིང་འཇམ་པ་ཁ་དོག་རྣམ་པ་ཐ་དད་པའི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine, delicate, stainless clothing.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་གདུགས་རྣམ་པར་བྱེ་བ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine parasols of different kinds.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སེང་གེ་ཡིད་དུ་འོང་བའི་རྒྱལ་མཚན་གྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of beautiful lion banners.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་འབར་བའི་ལྕེ་ཤིན་ཏུ་འཕྲོ་བའི་རིན་པོ་ཆེའི་བ་དན་གྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པར་རྒྱལ་པོ་འོད་ཆེན་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བྱིན་གྱིས་བརླབས་སོ། གླང་པོའི་རྒྱལ་པོ་ཆེན་པོ་ཤུགས་འཛིན་གྱིས་ཀྱང་གླང་པོའི་དབང་པོའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པའི་མཐུས་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་པད་མོའི་སྤྲིན་གྲངས་མེད་པས་ཀུན་ནས་ཡོག་པར་བྱིན་གྱིས་བརླབས་སོ། །ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེའི་སེ་མོ་དོ་གྲངས་མེད་པར་རབ་ཏུ་འཕྱད་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྣམ་བུའི་ལྡ་ལྡི་དང་། ཆུན་པོ་གྲངས་མེད་པར་རབ་ཏུ་འཕྱང་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བའི་རྒྱུད་གྲངས་མེད་པ་མངོན་པར་འཕྱང་བའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་།
en: There was the adornment of the rain that fell from clouds of countless precious flags shining with the blazing light of divine jewels.

source: ལྷ་རྫས་ཀྱི་རིན་པ་ཆེ་སྣ་ཚོགས་ཀྱི་ལྷབ་ལྷུབ་དང་། ཕྲེང་བ་གྲངས་མེད་པ་མངོན་པར་འཕྱང་བའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་ལྡ་ལྡི་གྲངས་མེད་པ་མངོན་པར་བྲིས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་སྤོས་ཀྱི་རྒྱལ་པོའི་ཁ་དོག་སྣ་ཚོགས་ཕྱོགས་ཐམས་ཅད་དུ་དྲི་ཞིམ་པོས་རྒྱས་པར་འགེངས་པའི་སྤྲིན་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་གོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་བདུག་སྤོས་ཀྱི་དུད་པ་ན་བུན་དུ་འགྲིགས་པའི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་ཕྱེ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་ཕྲ་མོ་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ལྷ་རྫས་ཀྱི་རོལ་མོ་བྱེད་པ་དང་།
en: Airāvaṇa and all the kings of elephants were in the sky, and through the inconceivable miraculous powers of the lords of the elephants, the leaders of the herds, they manifested in the sky clouds of a variety of countless divine, precious lotuses that covered the entire expanse of the sky; of countless divine, precious hanging strings of jewels; of countless divine, precious hanging clusters of streamers and wreaths; of hanging adornments of countless varieties of divine, precious flower garlands; of hanging adornments of countless varieties of divine, precious strings of jewelry; and of hanging adornments of countless varieties of divine, precious wreaths of flowers; the adornment of sky-covering clouds of perfume composed of countless varieties of divine, precious kings of scents of different colors that filled all directions with a lovely aroma; the adornment of rain from clouds of divine, precious clothing of various colors; the adornment of rain from clouds of a divine mass of incense smoke; the adornment of a delicate rain from clouds of divine powders of different colors; and the adornment of rain from sky-covering clouds of the sweet and melodious music and songs of praise by a host of apsarases.

source: གླུ་སྙན་པའི་དབྱངས་ཡིད་དུ་འོང་བར་ལེན་ཅིང་བསྟོད་པའི་སྤྲིན་གྱིས་ཡོག་པའི་ཆར་མངོན་པར་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པར་ནམ་མཁའི་དབྱིངས་བྱིན་གྱིས་བརླབས་སོ། སྲིན་པོའི་དབང་པོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་རྒྱ་མཚོ་ལ་གནས་པ་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྟེན་གྱིས་གཞི་ལ་གནས་པ། ཁ་ཟས་སུ་ཤ་དང་ཁྲག་འཐུང་ཞིང་ཟ་བ། ཆུ་ལ་སྤྱོད་པ་དང་། རི་དགས་དང་། ཕྱུགས་དང་བྱ་དང་བ་ལང་དང་རྟ་དང་། གླང་པོ་དང་བོང་བུ་དང་། སྐྱེས་པ་དང་། བུད་མེད་ཀྱི་ཚོགས་ཀྱི་མདངས་འཕྲོགས་པ།
en: Countless hundreds of thousands of rākṣasa lords who dwell in the sea and on the land, who dwell in our world realm of four continents, whose food is flesh and whose drink is blood, who steal the vitality of those creatures that live in the water and of deer, cattle, birds, oxen, horses, elephants, donkeys, men, and women, whose minds have thoughts of anger and who always harm and injure beings, all gained the highest motivation of love and altruism; their faces having become serene, they became dedicated to not causing violence or injury to any being, their thoughts upon the next world after death, and with their palms together in homage, with the highest happiness, they bowed in the direction of King Mahāprabha, experiencing an unequaled vast bliss of mind and body.

source: ཞེ་སྡང་བའི་ཡིད་ཀྱི་རྣམ་པར་རྟོག་པ་དང་ལྡན་པ། རྟག་ཏུ་འགྲོ་བ་ལ་འཚེ་ཞིང་འཐོ་འཚམ་པ་ལ་ཞུགས་པ་རྣམས་ཀྱང་བྱམས་པ་དང་། ཕན་པའི་སེམས་དམ་པ་དང་ལྡན་ཞིང་བཞིན་གྱི་མདོག་ཤིན་ཏུ་དང་བ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་མི་འཚེ་ཞིང་མཐོ་འཚམ་པ་མེད་པ་ལ་ཞུགས་ཏེ། འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བར་གྱུར་ནས། ཐལ་མོ་སྦྱར་ཅིང་ཤིན་ཏུ་དགའ་བའི་སེམས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་བཏུད་ནས་ཕྱག་འཚལ་བར་གྱུར་ཏོ། །ལུས་དང་སེམས་ཀྱི་བདེ་བ་རྒྱ་ཆེན་པོ་མཚུངས་པ་མེད་པ་ཡང་མྱོང་བར་གྱུར་ཏོ། །གནོད་སྦྱིན་དང་གྲུལ་བུམ་དང་། ཤ་ཟ་དང་འབྱུང་བོའི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་བྱམས་པ་དང་། ཕན་པའི་སེམས་དམ་པ་དང་ལྡན་ཞིང་བཞིན་གྱི་མདོག་ཤིན་ཏུ་དང་བ་དང་།
en: Hundreds of thousands of lords of yakṣas, mahoragas, piśācas, and bhūtas with the highest motivation of love and altruism, their faces having become serene and their thoughts upon the next world after death, became dedicated to not causing violence or injury to any being.
